Revit 2027 API
PolymeshFacet.IsValidObject Property
 Specifies whether the .NET object represents a valid Revit entity.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidObject { get; }
Public ReadOnly Property IsValidObject As Boolean
	Get
public:
property bool IsValidObject {
	bool get ();
}
member IsValidObject : bool with get
Return Value
Boolean
 True if the API object holds a valid Revit native object, false otherwise.
Remarks
 This property is always True for a polymesh facet.
See Also
Reference
PolymeshFacet Class
Autodesk.Revit.DB Namespace